app/Models/MemberModel.php

    public function getMember($slug = false)
    {
        if ($slug === false) {
            return $this->findAll();
---
SELECT *
FROM `member`